def bootstrap():
    print(f'\n\n{'*' * 12} start {'*' * 12}', sep='', end='\n\n')

    s1 = '1234567890'
    print(f's1: {s1}')
    print(f'访问 {s1} 的一个字符: s1[0] === {s1[0]}')
    print(f'访问 {s1} 的倒数一个字符: s1[0] === {s1[-1]}')

    print(f'\n{'*'*12} 字符串切片 {'*'*12}')
    print(f'{s1[0:4]}') # 包头不包尾
    print(f'{s1[6:9]}') # 包头不包尾
    print(f'{s1[0:9:2]}') # 从头开始取到尾，隔2个单位取一个
    print(f'{s1[::2]}') # 从头开始取到尾，隔2个单位取一个
    print(f'{s1[1:9:2]}') # 从索引1开始取到尾，隔2个单位取一个

    print(f'\n{'*'*12} 字符串反转 {'*'*12}')
    print(f'{s1[-1:-10:-1]}')
    print(f'{s1[::-1]}')

if __name__ == '__main__':
    bootstrap()